import React from 'react';
import { useNavigate } from 'react-router-dom';

function Policy() {

    const navigate = useNavigate()

    return (
        <>
            <div className='privacy-head'>
                <h1>Політика конфіденційності</h1>
            </div>
            <div className='policy-container'>
                <ul className='about-us-section'>
                    <li> <a href='#about-us' >Про нас</a></li>
                    <li> <a href='#privacy-rules' >Правила приватності</a></li>
                    <li> <a href='#cookie-policy' >Cookie</a></li>
                    <li> <a href='#terms-and-use' >Умови та використання</a></li>
                    <li> <a href='#job-rules' >Правила розміщення вакансій</a></li>
                    <li> <a href='#contact-us' >Зв'яжіться з нами</a></li>
                </ul>
                <div className='policy-details'>
                    <section id='about-us'>
                        <h1>Вітаємо</h1>
                        <p>Ми раді вітати вас у кінцевому пункті вашої кар'єрної подорожі. Незалежно від того, чи ви досвідчений професіонал, який шукає нових викликів, чи нещодавній випускник, який розпочинає свій кар'єрний шлях, даний сайт допоможе вам на кожному кроці.</p>
                        <h4>Відкрийте для себе нові можливості:</h4>
                        <p>Відкрийте для себе світ кар'єрних можливостей, досліджуючи різноманітні вакансії, що відповідають вашим навичкам, інтересам та прагненням. Наша платформа з'єднує вас з найкращими роботодавцями, допомагаючи знайти ідеальну роботу, що відповідає вашим талантам</p>
                        <h4>Ваш успіх, наша місія:</h4>
                        <p>Наша місія - бути вашим надійним партнером на вашому кар'єрному шляху. Від першого кроку пошуку роботи до святкування ваших досягнень - ми тут, щоб підтримати вас. Ваш успіх - це не просто пункт призначення, це подорож, в яку ми вирушаємо разом. Розпочніть свою захоплюючу кар'єрну пригоду з [Назва сайту для пошуку роботи]. Ми тут, щоб допомогти вам перетворити ваші прагнення на реальність. Ласкаво просимо на борт!</p>
                        <button className='btn' onClick={() => navigate("/")}>Головна</button>
                    </section>

                    <section id="privacy-rules">
                        <h1>Правила конфіденційності</h1>
                        <p>Ласкаво просимо на сторінку Правил конфіденційності. Ми надаємо пріоритет захисту вашої особистої інформації і зобов'язуємося зберігати конфіденційність, цілісність і безпеку даних, які ви нам довіряєте. У цьому документі викладено наші правила конфіденційності, де детально описано, як ми збираємо, використовуємо та захищаємо вашу інформацію.</p>
                        <h4> Інформація, яку ми збираємо:</h4>
                        <p>Ми збираємо інформацію, щоб покращити ваш досвід пошуку роботи та надати персоналізовані послуги. Це може включати в себе</p>
                        <ul>
                            <li>Особиста інформація: Ім'я, контактні дані, резюме та історія працевлаштування.</li>
                            <li>Дані про використання: Інформація про вашу взаємодію з нашою платформою, наприклад, про пошук роботи та історію заявок.</li>
                            <li>Інформація про пристрій: Дані про ваш пристрій, браузер та IP-адресу для цілей безпеки та аналітики.</li>
                        </ul>
                        <h4>Як ми використовуємо вашу інформацію:</h4>
                        <ul>
                            <li>Сприяти пошуку роботи: Підберемо для вас відповідні вакансії на основі ваших навичок та вподобань.</li>
                            <li>Покращуйте користувацький досвід: Пристосуйте нашу платформу до ваших потреб і покращіть загальний досвід роботи.</li>
                            <li>Комунікація: Надсилати вам оновлення, сповіщення про вакансії та відповідну інформацію про наші послуги.</li>
                        </ul>
                    </section>

                    <section id='cookie-policy'>
                        <h1>Політика щодо файлів cookie</h1>
                        <h4>Короткий виклад політики щодо файлів cookie:</h4>
                        <p>Ласкаво просимо до короткого огляду Політики використання файлів cookie на нашому сайті. Цей короткий огляд покликаний допомогти вам зрозуміти, як ми використовуємо файли cookie та подібні технології для покращення вашого досвіду роботи в Інтернеті. Для більш детальної інформації, будь ласка, зверніться до нашої повної Політики використання файлів cookie.</p>
                        <h4>1. Що таке файли cookie?</h4>
                        <p>Файли cookie - це невеликі текстові файли, які зберігаються на вашому пристрої, коли ви відвідуєте веб-сайт. Вони допомагають нам покращити функціональність та продуктивність нашого сайту, вмикаючи певні функції та надаючи аналітику.</p>
                        <h4>2. Типи файлів cookie, які ми використовуємо:</h4>
                        <p><b>Основні Cookies:</b>Необхідні для базового функціонування веб-сайту.</p>
                        <p><b>Функціональні Cookies:</b>Покращуйте користувацький досвід, запам'ятовуючи його уподобання.</p>
                        <p><b>Аналітичні Cookies:</b>Збирати анонімні дані для статистичного аналізу використання веб-сайту.</p>
                        <p><b>Рекламні Cookies:</b>Адаптуйте рекламний контент під свої інтереси.</p>
                        <h4>3. Чому ми використовуємо файли cookie:</h4>
                        <p>Ми використовуємо файли cookie для оптимізації вашого перегляду, персоналізації контенту, аналізу відвідуваності сайту та вимірювання ефективності наших маркетингових зусиль. Файли cookie також відіграють важливу роль у підтримці безпеки та цілісності нашого сайту.</p>
                        <h4>4. Сторонні файли cookie:</h4>
                        <p>Деякі файли cookie можуть розміщуватися сторонніми сервісами, які з'являються на наших сторінках. Ці зовнішні сервіси мають власну політику конфіденційності, і ми рекомендуємо вам ознайомитися з нею, щоб мати повне уявлення про їхню практику.</p>
                        <h4>5. Керування файлами cookie:</h4>
                        <p>Ви можете прийняти або відхилити файли cookie. Більшість веб-браузерів автоматично приймають файли cookie, але ви можете змінити налаштування свого браузера, щоб відхилити їх, якщо бажаєте. Однак це може вплинути на вашу здатність повною мірою користуватися нашим веб-сайтом.</p>
                        <h4>7. Оновлення Політики:</h4>
                        <p>Ми можемо оновлювати нашу Політику використання файлів cookie, щоб відобразити зміни в технологіях або законодавчих вимогах. Ми рекомендуємо періодично перевіряти цю сторінку на наявність оновлень.
                            Для більш детального пояснення нашої Політики щодо файлів cookie, будь ласка, прочитайте повну версію політики, доступну на нашому веб-сайті. Якщо у вас виникли запитання або занепокоєння, не соромтеся звертатися до нас. Дякуємо, що вирішили вивчити наш веб-сайт.</p>
                    </section>

                    <section id='terms-and-use'>
                        <h1>Умови та використання</h1>
                        <p>Отримуючи доступ до нашого веб-сайту та використовуючи його, ви погоджуєтеся дотримуватися наступних положень та умов. Вміст цього сайту надається лише для загальних інформаційних цілей, і ми залишаємо за собою право змінювати або припиняти роботу будь-якого аспекту веб-сайту в будь-який час. Хоча ми прагнемо забезпечити точність і актуальність представленої інформації, ми не даємо жодних запевнень або гарантій, явних або неявних, щодо повноти, точності, надійності, придатності або доступності веб-сайту або інформації, продуктів, послуг або пов'язаних з ними графічних зображень, що містяться на веб-сайті. Ви використовуєте будь-яку інформацію або матеріали на цьому веб-сайті виключно на власний ризик, і ми не несемо відповідальності за будь-які прямі або непрямі збитки, пов'язані з таким використанням. Ми рекомендуємо вам ознайомитися з нашою Політикою конфіденційності та Політикою використання файлів cookie, щоб зрозуміти, як ми обробляємо вашу особисту інформацію. Використовуючи цей сайт, ви погоджуєтеся з нашими умовами та політиками, і ваше подальше використання означає прийняття будь-яких оновлень або змін до цих умов. Якщо ви не згодні з будь-якою частиною цих умов, будь ласка, утримайтеся від використання нашого веб-сайту.</p>
                    </section>

                    <section id='job-rules'>
                        <h1>Правила розміщення вакансій</h1>
                        <p>Ми прагнемо підтримувати професійне та інклюзивне середовище як для роботодавців, так і для пошукачів. Щоб забезпечити позитивний досвід для всіх користувачів, будь ласка, дотримуйтесь наступних правил розміщення вакансій:</p>                        <h4>1. Точна та прозора інформація:</h4>
                        <p>Надайте точну та прозору інформацію про вакансію. Чітко сформулюйте назву посади, обов'язки, кваліфікацію та іншу відповідну інформацію, щоб допомогти кандидатам прийняти обґрунтоване рішення.</p>                        <h4>2. Політика недискримінації:</h4>
                        <p>Оголошення про вакансії повинні відповідати антидискримінаційному законодавству та сприяти забезпеченню рівних можливостей. Уникайте формулювань або вимог, які можуть бути дискримінаційними за ознакою раси, статі, віку, інвалідності, релігії або будь-якої іншої захищеної характеристики.</p>                        <h4>3. Легальні можливості працевлаштування:</h4>
                        <p>Опубліковуйте тільки справжні вакансії. Оманливі або шахрайські оголошення про вакансії суворо заборонені. Переконайтеся, що посада відповідає чинному трудовому законодавству та нормативним актам.</p>                        <h4>4. Ніякого багаторівневого маркетингу (MLM) або фінансових пірамід:</h4>
                        <p>Не приймаються вакансії, пов'язані з багаторівневим маркетингом, фінансовими пірамідами або будь-якими іншими підозрілими бізнес-моделями. Ми надаємо перевагу легальним можливостям працевлаштування.</p>                        <h4>5. Чіткий процес подачі заявки:</h4>
                        <p>Чітко окресліть процес подання заявки, зокрема, як кандидати мають подавати заявку, необхідні документи та будь-які конкретні інструкції. Зробіть так, щоб кандидатам було легко його зрозуміти та виконати.

                        </p>
                    </section>

                    <section id='contact-us'>
                        <h1>Зв'яжіться з нами</h1>
                        <p>Якщо у вас є питання або занепокоєння щодо вашої конфіденційності, будь ласка, зв'яжіться з нашою командою з питань конфіденційності за адресою <a href="">Stepanchukdima13@gmail.com</a>.

                            Використовуючи даний сайт, ви погоджуєтеся з нашими Правилами конфіденційності. Ваша довіра важлива для нас, і ми зобов'язуємося захищати вашу конфіденційність протягом усього процесу пошуку роботи.</p>       </section>
                </div>
            </div>
        </>
    );
}

export default Policy;